

# [문제] member테이블에서 id가 qwer인 회원의 이름과 비밀번호 조회하기
# [문제] member테이블에서 name이 신혜정보다 뒤에 위치한 이름 조회하기
# [문제] member테이블에서 id가 m과 s사이의 데이터를 조회하기
# [문제] member테이블에서 id가 m과 s 범위의 값을 제외한 조회하기
# [문제] book테이블에서 book_kind가 문학(100)인 책정보 조회하기
# [문제] book테이블에서 가격이 15,000원 이하인 책정보 조회하기
# [문제] book테이블에서 문학(100)이 아닌 책정보만 조회하기
# [문제] book테이블에서 2020년 이전에 등록된 책정보만 조회하기
# [문제] book테이블에서 컴퓨터(300)이면서 가격이 15,000원 이상인 책정보 조회하기
# [문제] book테이블에서 재고가 없는 책정보 조회하기
# [문제] book테이블에서 문학(100)이거나 컴퓨터(300)인 책정보 조회하기
# [문제] book테이블에서 할인률이 없는 책정보 조회하기
# [문제] book테이블에서 할인률이 있는 책정보 조회하기
# [문제] book테이블에서 도서 재고 수량이 10개 이상이고 20개 이하인 책정보 조회하기
# [문제] book테이블에서 도서 등록일이 '2014-02-08' 부터 '2014-11-22' 인 책 정보 조회하기
# [문제] book테이블에서 도서 할인율이 0 또는 5 또는 10인 책 정보 조회하기
# [문제] book_kind가 100 또는 300 이면서 book_discount_rate가 20인 데이터 조회하기