package B0403클래스와메서드데이터_문제;
/*

	[문제]
		전체 데이터를 출력하시오.

	
 */

/*
		1001 500 3 1500
		1002 1200 1 1200
		1003 4300 3 12900
		1004 2300 4 9200
		1005 5000 2 10000
 */
class Item{
	int number;
	int price;
	int count;
	int total;
	
}

public class B0403문제01 {
	public static void main(String[] args) {
		 int[][] arr = {
	                {1001, 500, 3, 1500},
	                {1002, 1200, 1 , 1200},
	                {1003, 4300, 3, 12900},
	                {1004, 2300, 4 , 9200},
	                {1005, 5000, 2 , 10000},
	     };

	    
		
	}
}